controllers/NewsController.php

    protected function findModel($id)
    {
        if (($model = News::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `news` WHERE `id`='15'