controllers/SiteController.php

    public function actionIndex()
    {
        $models = \app\models\News::find()->all(); // Fetch all news data
---
SELECT * FROM `news`