controllers/UserController.php

SELECT * FROM `user` WHERE `id`='328'
---
    protected function findModel($id)
    {
        if (($model = User::findOne(['id' => $id])) !== null) {